app/views/posts/_post.html.erb

SELECT "sounds".* FROM "sounds" WHERE "sounds"."user_id" = $1  [["user_id", "3"]]
---
            <%= content_tag :option, "add voice" %>
          <% @user.sounds.each do |s| -%>