app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "img_url", "video_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "This is a test posting"], ["img_url", ""], ["video_url", ""], ["user_id", "1"], ["created_at", "2015-12-23 01:22:18.429780"], ["updated_at", "2015-12-23 01:22:18.429780"]]
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "I don't feel so pretty in this one"], ["updated_at", "2016-01-03 00:24:15.078041"], ["id", 3]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(post_params)