app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["email", "test@test.com"]]
---
  def create
    user = User.where(email: user_params[:email]).first