app/controllers/static_pages_controller.rb

  def home
    @random = User.all.sample.profile_img
---
SELECT "users".* FROM "users"