app/controllers/users_controller.rb

  def create
    if User.new(user_params).save
---
INSERT INTO "users" ("email", "name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @user = User.find(params[:id])
    @posts = @user.posts
    @sounds = @user.sounds
    if @user.update_attributes(profile_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "users" SET "password_digest" = $1, "profile_img" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_digest", "$2a$10$lRHPXCdCQ/04ZwOh.x8uHeXi3ssYwAdrkTE5Vjo2u/Dk.sgSf/Mje"], ["profile_img", "cotton-profile-img.png"], ["updated_at", "2016-01-02 19:50:59.531168"], ["id", 3]]